{
  "posts": [
    {
      "id": 1,
      "title": "json-server",
      "author": "typicode",
        "detail":{"#One morning, when Gregor Samsa woke from troubled dreams.\n    One morning, when Gregor Samsa woke from troubled dreams, he found himself *transformed* in his bed into a horrible [vermin](http://en.wikipedia.org/wiki/Vermin \"Wikipedia Vermin\"). He lay on his armour-like back, and if he lifted his head a little he could see his brown belly, slightly domed and divided by arches into stiff sections. The bedding was hardly able to cover **strong** it and seemed ready to slide off any moment. His many legs, pitifully thin compared with the size of the rest of him, link waved abouthelplessly as he looked. <cite>“What's happened to me?”</cite> he thought. It wasn't a dream. His room, a proper human room although a little too small, lay peacefully between its four familiar walls.</p>\n\n    ## The bedding was hardly able to cover it.\n\n    It showed a lady fitted out with a fur hat and fur boa who sat upright, raising a heavy fur muff that covered the whole of her lower arm towards the viewer a solid fur muff into which her entire forearm disappeared..\n\n    ### Things we know about Gregor's sleeping habits.\n\n    - He always slept on his right side.\n    - He has to get up early (to start another dreadful day).\n    - He has a drawer and a alarm clock next to his bed.\n    - His mother calls him when he gets up to late.\n\n\n    <table class": "\"data\">\n    <tr>\n    <th>Writer</th>\n    <th>Nationality</th>\n    <th>Genre</th>\n    <th>Most famous book</th>\n    </tr>\n    <tr>\n    <td>Franz Kafka</td>\n    <td>Leo Tolstoy</td>\n    <td>F. Scott Fitzgerald</td>\n    <td>H.G. Wells</td>\n    </tr>\n    <tr>\n    <td>Austrian</td>\n    <td>Russia</td>\n    <td>American</td>\n    <td>British</td>\n    </tr>\n    <tr>\n    <td>Literature & Fiction, Philosophy, Short Stories</td>\n    <td>Literature & Fiction, Philosophy</td>\n    <td>Literature & Fiction, Short Stories</td>\n    <td>Science Fiction</td>\n    </tr>\n    <tr>\n    <td>The Metamorphosis</td>\n    <td>War & Piece</td>\n    <td>The Great Gatsby</td>\n    <td>War of the Worlds</td>\n    </tr>\n    </table>\n\n    import logo from './logo.svg'", "\n\nimport ‘./App.css’": null, " import HomePage from ‘./pages/HomePage’": null, " import\nuseDarkMode from ‘./useDarkMode’": null, " import Header from\n‘./components/Header’": null, " import { Routes, Route } from ‘react-router-dom’": null, "\nimport NotFound from ‘./pages/NotFound’": null, " import Categories from\n‘./pages/Categories’": null, "\n\nfunction App() { useDarkMode()": null, " return (\n      <div className": null, " }\n\nexport default App": null, "\n\n    First he wanted to stand up quietly and undisturbed, get dressed, above all have breakfast, and only then consider further action, for (he noticed this clearly) by thinking things over in bed he would not reach a reasonable conclusion. He remembered that he had already often felt a light pain or other in bed, perhaps the result of an awkward lying position, which later turned out to be purely imaginary when he stood up, and he was eager to see how his present fantasies would gradually dissipate. That the change in his voice was nothing other than the onset of a real chill, an occupational illness of commercial travelers, of that he had not the slightest doubt.\n\n    function metamorphose(protagonist,author){\n    if( protagonist.name.first ": null, "\n    }\n    }\n\n    It was very easy to throw aside the blanket. He needed only to push himself up a little, and it fell by itself. But to continue was difficult, particularly because he was so unusually wide. He needed arms and hands to push himself upright. Instead of these, however, he had only many small limbs which were incessantly moving with very different motions and which, in addition, he was unable to control. If he wanted to bend one of them, then it was the first to extend itself, and if he finally succeeded doing with this limb what he wanted, in the meantime all the others, as if left free, moved around in an excessively painful agitation. \"But I must not stay in bed uselessly,\" said Gregor to himself.\n\n    > At first he wanted to get off the bed with the lower part of his body, but this lower part (which he incidentally had not yet looked at and which he also couldn't picture clearly) proved itself too difficult to move. The attempt went so slowly. When, having become almost frantic, he finally hurled himself forward with all his force and without thinking, he chose his direction incorrectly, and he hit the lower bedpost hard. The violent pain he felt revealed to him that the lower part of his body was at the moment probably the most sensitive.\n\n    Thus, he tried to get his upper body out of the bed first and turned his head carefully toward the edge of the bed. He managed to do this easily, and in spite of its width and weight his body mass at last slowly followed the turning of his head. But as he finally raised his head outside the bed in the open air, he became anxious about moving forward any further in this manner, for if he allowed himself eventually to fall by this process, it would take a miracle to prevent his head from getting injured. And at all costs he must not lose consciousness right now. He preferred to remain in bed.\n\n    #### First five selected publications in English\n    1. The Castle\n    2. The Great Wall of China\n    3. The Trial\n    4. America\n    5. The Diaries Of Franz Kafka\n\n    ***": null}

    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  }

 
       
  
 
    
}